<?php
/*///////////////////////////////////////////////////////////////////////////////////////////
Библиотека общих функций моудуля
*////////////////////////////////////////////////////////////////////////////////////////////
class News extends MAIN_MODULES_CLASS {

	function setDatetime($date) {
		$montharray 	= array('1' => 'января','2' => 'февраля','3' => 'марта','4' => 'апреля','5' => 'мая','6' => 'июня','7' => 'июля','8' => 'августа','9' => 'сентября','10' => 'октября','11' => 'ноября','12' => 'декабря');
		$dateconvert 	= explode('.',$date);
		$dateconvert[1]	= intval($dateconvert[1]);
		$month 			= $montharray[$dateconvert[1]];
		$day   			= $dateconvert[0];
		$year  			= $dateconvert[2];

		return $day.' '.$month.' '.$year;
	}	
	
}
?>